# –í–µ–±–∏–Ω–∞—Ä. –ë–∏–±–ª–∏–æ—Ç–µ–∫–∞ Pandas

## –ü—Ä–æ–≤–µ—Ä–∫–∞ —Å–≤—è–∑–∏

**–ü–æ—Å—Ç–∞–≤—å—Ç–µ –≤ —á–∞—Ç:**<br>
\+ –µ—Å–ª–∏ –º–µ–Ω—è –≤–∏–¥–Ω–æ –∏ —Å–ª—ã—à–Ω–æ<br>
‚Äì –µ—Å–ª–∏ –Ω–µ—Ç

**–ï—Å–ª–∏ —É –≤–∞—Å –Ω–µ—Ç –∑–≤—É–∫–∞:**

* —É–±–µ–¥–∏—Ç–µ—Å—å, —á—Ç–æ –Ω–∞ –≤–∞—à–µ–º —É—Å—Ç—Ä–æ–π—Å—Ç–≤–µ –∏ –≤ –∫–æ–ª–æ–Ω–∫–∞—Ö –≤–∫–ª—é—á—ë–Ω –∑–≤—É–∫

* –æ–±–Ω–æ–≤–∏—Ç–µ —Å—Ç—Ä–∞–Ω–∏—Ü—É –≤–µ–±–∏–Ω–∞—Ä–∞ –∏–ª–∏ –∑–∞–∫—Ä–æ–π—Ç–µ —Å—Ç—Ä–∞–Ω–∏—Ü—É –∏ –ø–µ—Ä–µ–ø–æ–¥–∫–ª—é—á–∏—Ç–µ—Å—å

* –æ—Ç–∫—Ä–æ–π—Ç–µ –≤–µ–±–∏–Ω–∞—Ä –≤ –¥—Ä—É–≥–æ–º –±—Ä–∞—É–∑–µ—Ä–µ

* –ø–µ—Ä–µ–∑–∞–≥—Ä—É–∑–∏—Ç–µ –≤–∞—à–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ –∏ –≤–æ–π–¥–∏—Ç–µ —Å–Ω–æ–≤–∞

## –û —Å–ø–∏–∫–µ—Ä–µ

**–ü–æ–≥—É–¥–∏–Ω–∞ –î–∞—Ä—å—è**
- —ç–∫—Å–ø–µ—Ä—Ç-—Ä–∞–∑—Ä–∞–±–æ—Ç—á–∏–∫ –Ω–∞ Python –≤ –æ–±–ª–∞—Å—Ç–∏ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏–æ–Ω–Ω–æ–π –±–µ–∑–æ–ø–∞—Å–Ω–æ—Å—Ç–∏ –∏ –≤ —Ñ–∏–Ω—Ç–µ—Ö–µ
- —Å–µ—Ä—Ç–∏—Ñ–∏—Ü–∏—Ä–æ–≤–∞–Ω–Ω—ã–π —Å–ø–µ—Ü–∏–∞–ª–∏—Å—Ç –ø–æ –±–∞–∑–∞–º –¥–∞–Ω–Ω—ã—Ö
- –±–æ–ª–µ–µ 8 –ª–µ—Ç –æ–ø—ã—Ç–∞ —Ä–∞–∑—Ä–∞–±–æ—Ç–∫–∏, –∏–∑ –Ω–∏—Ö –±–æ–ª–µ–µ 4 –ª–µ—Ç ‚Äî –Ω–∞ Python
- 3 –≥–æ–¥–∞ –≤ —Å—Ñ–µ—Ä–µ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏–æ–Ω–Ω–æ–π –±–µ–∑–æ–ø–∞—Å–Ω–æ—Å—Ç–∏ —Å —Ä–∞–∑—Ä–∞–±–æ—Ç–∫–æ–π –ü–û –Ω–∞ Python

## –ü—Ä–∞–≤–∏–ª–∞ —É—á–∞—Å—Ç–∏—è

*   –ü—Ä–∏–≥–æ—Ç–æ–≤—å—Ç–µ –±–ª–æ–∫–Ω–æ—Ç –∏ —Ä—É—á–∫—É, —á—Ç–æ–±—ã –∑–∞–ø–∏—Å—ã–≤–∞—Ç—å –≤–∞–∂–Ω—ã–µ –º—ã—Å–ª–∏ –∏ –∏–¥–µ–∏
*   –ü—Ä–æ–¥–æ–ª–∂–∏—Ç–µ–ª—å–Ω–æ—Å—Ç—å –≤–µ–±–∏–Ω–∞—Ä–∞ ‚Äî 80 –º–∏–Ω—É—Ç
*   –í—ã –º–æ–∂–µ—Ç–µ –ø–∏—Å–∞—Ç—å —Å–≤–æ–∏ –≤–æ–ø—Ä–æ—Å—ã –≤ —á–∞—Ç–µ –∏–ª–∏ –∑–∞–¥–∞–≤–∞—Ç—å –∏—Ö –≤—Å–ª—É—Ö
*   –ó–∞–ø–∏—Å—å –≤–µ–±–∏–Ω–∞—Ä–∞ –±—É–¥–µ—Ç –¥–æ—Å—Ç—É–ø–Ω–∞ –≤ –ª–∏—á–Ω–æ–º –∫–∞–±–∏–Ω–µ—Ç–µ

## –¶–µ–ª—å –∑–∞–Ω—è—Ç–∏—è

–ù–∞—É—á–∏—Ç—å—Å—è —Ä–∞–±–æ—Ç–∞—Ç—å —Å –±–∏–±–ª–∏–æ—Ç–µ–∫–æ–π Pandas:
- –∑–∞–≥—Ä—É–∂–∞—Ç—å –¥–∞–Ω–Ω—ã–µ –∏–∑ —Ä–∞–∑–ª–∏—á–Ω—ã—Ö —Ñ–æ—Ä–º–∞—Ç–æ–≤ –≤–Ω–µ—à–Ω–∏—Ö –∏—Å—Ç–æ—á–Ω–∏–∫–æ–≤
- —Ñ–∏–ª—å—Ç—Ä–æ–≤–∞—Ç—å, —Å–æ—Ä—Ç–∏—Ä–æ–≤–∞—Ç—å, –≥—Ä—É–ø–ø–∏—Ä–æ–≤–∞—Ç—å –∏ –∞–≥—Ä–µ–≥–∏—Ä–æ–≤–∞—Ç—å –¥–∞–Ω–Ω—ã–µ

## –ü–ª–∞–Ω –∑–∞–Ω—è—Ç–∏—è

1. –ß—Ç–µ–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö –∏–∑ –≤–Ω–µ—à–Ω–∏—Ö –∏—Å—Ç–æ—á–Ω–∏–∫–æ–≤
2. –ú–µ—Ç–æ–¥—ã –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–æ–≤
3. –°–æ—Ä—Ç–∏—Ä–æ–≤–∫–∞ –¥–∞–Ω–Ω—ã—Ö
4. –ì—Ä—É–ø–ø–∏—Ä–æ–≤–∫–∞ –¥–∞–Ω–Ω—ã—Ö
5. –≠–∫—Å–ø–æ—Ä—Ç –¥–∞–Ω–Ω—ã—Ö

## –í–∞—à–∏ –≤–æ–ø—Ä–æ—Å—ã

## 1. –ß—Ç–µ–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö –∏–∑ –≤–Ω–µ—à–Ω–∏—Ö –∏—Å—Ç–æ—á–Ω–∏–∫–æ–≤

### –ò–º–ø–æ—Ä—Ç –º–æ–¥—É–ª—è pandas

In [ ]:
import pandas as pd

### –û—Å–Ω–æ–≤–Ω—ã–µ –º–µ—Ç–æ–¥—ã –∑–∞–≥—Ä—É–∑–∫–∏ –¥–∞–Ω–Ω—ã—Ö

| –ú–µ—Ç–æ–¥                 | –ß—Ç–æ –¥–µ–ª–∞–µ—Ç                                   | –ù–∞ –≤—Ö–æ–¥                               | –ù–∞ –≤—ã—Ö–æ–¥           | –ß–∞—Å—Ç—ã–µ –∞—Ä–≥—É–º–µ–Ω—Ç—ã                       |
| --------------------- | -------------------------------------------- | ------------------------------------- | ------------------ | -------------------------------------- |
| `pd.read_clipboard()` | –ß–∏—Ç–∞–µ—Ç —Ç–∞–±–ª–∏—Ü—É, —Å–∫–æ–ø–∏—Ä–æ–≤–∞–Ω–Ω—É—é –≤ –±—É—Ñ–µ—Ä –æ–±–º–µ–Ω–∞ | ‚Äî                                     | `DataFrame`        | `sep` ‚Äî —Ä–∞–∑–¥–µ–ª–∏—Ç–µ–ª—å, –µ—Å–ª–∏ –Ω–µ —Ç–∞–±—É–ª—è—Ü–∏—è |
| `pd.read_html()`      | –ò–∑–≤–ª–µ–∫–∞–µ—Ç —Ç–∞–±–ª–∏—Ü—ã –∏–∑ HTML-–∫–æ–¥–∞               | —Å—Ç—Ä–æ–∫–∞ HTML **–∏–ª–∏** –æ–±—ä–µ–∫—Ç `StringIO` | —Å–ø–∏—Å–æ–∫ `DataFrame` | `match`, `attrs`, `flavor`             |
| `pd.read_csv()`       | –ß–∏—Ç–∞–µ—Ç –¥–∞–Ω–Ω—ã–µ –∏–∑ CSV-—Ñ–∞–π–ª–∞                   | –ø—É—Ç—å –∫ —Ñ–∞–π–ª—É –∏–ª–∏ URL                  | `DataFrame`        | `sep`, `encoding`, `nrows`, `usecols`  |
| `pd.read_json()`      | –ß–∏—Ç–∞–µ—Ç –¥–∞–Ω–Ω—ã–µ –∏–∑ JSON                        | –ø—É—Ç—å –∫ —Ñ–∞–π–ª—É, —Å—Ç—Ä–æ–∫–∞ JSON –∏–ª–∏ URL     | `DataFrame`        | `orient`, `typ`                        |
| `pd.read_xml()`       | –ß–∏—Ç–∞–µ—Ç XML-—Ñ–∞–π–ª—ã                             | –ø—É—Ç—å –∫ —Ñ–∞–π–ª—É –∏–ª–∏ —Å—Ç—Ä–æ–∫–∞ XML           | `DataFrame`        | `xpath`                                |
| `pd.read_sql()`       | –í—ã–ø–æ–ª–Ω—è–µ—Ç SQL-–∑–∞–ø—Ä–æ—Å –∏ –≤–æ–∑–≤—Ä–∞—â–∞–µ—Ç —Ä–µ–∑—É–ª—å—Ç–∞—Ç  | SQL-–∑–∞–ø—Ä–æ—Å –∏ –æ–±—ä–µ–∫—Ç –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è       | `DataFrame`        | ‚Äî                                      |

In [ ]:
# –ß—Ç–µ–Ω–∏–µ –∏–∑ –±—É—Ñ–µ—Ä–∞ –æ–±–º–µ–Ω–∞
df = pd.read_clipboard()
df.head() # –í—ã–≤–æ–¥ –ø–µ—Ä–≤—ã—Ö —Å—Ç—Ä–æ–∫ –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞

#### –ß—Ç–µ–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö –∏–∑ HTML

In [ ]:
import requests
from io import StringIO

url = 'https://en.wikipedia.org/wiki/Minnesota'

header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
}

response = requests.get(url, headers=header)

html_str = StringIO(response.text)

df = pd.read_html(html_str)

type(df)
df[1].head()

      Location July (¬∞F) July (¬∞C) January (¬∞F) January (¬∞C)
0  Minneapolis     83/64     28/18         23/7       ‚àí4/‚àí13
1   Saint Paul     83/63     28/17         23/6       ‚àí5/‚àí14
2    Rochester     82/63     28/17         23/3       ‚àí5/‚àí16
3       Duluth     76/55     24/13         19/1       ‚àí7/‚àí17
4    St. Cloud     81/58     27/14        18/‚àí1       ‚àí7/‚àí18

In [ ]:
from bs4 import BeautifulSoup

# –†–∞–∑–±–∏—Ä–∞–µ–º HTML –ø—Ä–∏ –ø–æ–º–æ—â–∏ BeautifulSoup
soup = BeautifulSoup(response.text, "html.parser")

# –ù–∞—Ö–æ–¥–∏–º –≤—Å–µ —Ç–∞–±–ª–∏—Ü—ã
tables = soup.find_all("table")

print(f"–ù–∞–π–¥–µ–Ω–æ —Ç–∞–±–ª–∏—Ü: {len(tables)}")

# –ë–µ—Ä—ë–º –ø–µ—Ä–≤—É—é —Ç–∞–±–ª–∏—Ü—É –∏ –≤—ã–≤–æ–¥–∏–º –ø–µ—Ä–≤—ã–µ 500 —Å–∏–º–≤–æ–ª–æ–≤
print(tables[0].prettify()[:500])

–ù–∞–π–¥–µ–Ω–æ —Ç–∞–±–ª–∏—Ü: 28
<table class="infobox ib-settlement vcard">
 <tbody>
  <tr>
   <th class="infobox-above" colspan="2">
    <div class="fn org">
     Minnesota
    </div>
   </th>
  </tr>
  <tr>
   <td class="infobox-subheader" colspan="2">
    <div class="category">
     <a href="/wiki/U.S._state" title="U.S. state">
      State
     </a>
    </div>
   </td>
  </tr>
  <tr class="mergedtoprow">
   <td class="infobox-full-data maptable" colspan="2">
    <style data-mw-deduplicate="TemplateStyles:r1028600610">

In [ ]:
first_table_html = str(tables[1])
df = pd.read_html(StringIO(first_table_html))[0]
df.head()

      Location July (¬∞F) July (¬∞C) January (¬∞F) January (¬∞C)
0  Minneapolis     83/64     28/18         23/7       ‚àí4/‚àí13
1   Saint Paul     83/63     28/17         23/6       ‚àí5/‚àí14
2    Rochester     82/63     28/17         23/3       ‚àí5/‚àí16
3       Duluth     76/55     24/13         19/1       ‚àí7/‚àí17
4    St. Cloud     81/58     27/14        18/‚àí1       ‚àí7/‚àí18

In [ ]:
df = pd.read_html(html_str, attrs={'class': 'us-census-pop us-census-pop-right'})

df[0].head()

  Census     Pop. Note        %¬±
0   1850     6077  NaN         ‚Äî
1   1860   172023  NaN  2,730.7%
2   1870   439706  NaN    155.6%
3   1880   780773  NaN     77.6%
4   1890  1310283  NaN     67.8%

In [ ]:
table = soup.find("table", {"class": "us-census-pop us-census-pop-right"})

df = pd.read_html(StringIO(str(table)))[0]
df.head()

  Census     Pop. Note        %¬±
0   1850     6077  NaN         ‚Äî
1   1860   172023  NaN  2,730.7%
2   1870   439706  NaN    155.6%
3   1880   780773  NaN     77.6%
4   1890  1310283  NaN     67.8%

In [ ]:
pd.read_html(html_str, match = 'United States presidential election results for Minnesota')[0].head()

   Year Republican         Democratic         Third party(ies)
   Year        No.       %        No.       %              No.      %
0  2024    1519032  46.68%    1656979  50.92%            77909  2.39%
1  2020    1484065  45.28%    1717077  52.40%            76029  2.32%
2  2016    1323232  44.93%    1367825  46.44%           254176  8.63%
3  2012    1320225  44.96%    1546167  52.65%            70169  2.39%
4  2008    1275409  43.82%    1573354  54.06%            61606  2.12%

In [ ]:
# –ù–∞—Ö–æ–¥–∏–º –≤—Å–µ —Ç–∞–±–ª–∏—Ü—ã –Ω–∞ —Å—Ç—Ä–∞–Ω–∏—Ü–µ
tables = soup.find_all("table")

# –ü—Ä–æ—Ö–æ–¥–∏–º –ø–æ –∫–∞–∂–¥–æ–π —Ç–∞–±–ª–∏—Ü–µ –∏ –∏—â–µ–º —Ç—É, —É –∫–æ—Ç–æ—Ä–æ–π –∑–∞–≥–æ–ª–æ–≤–æ–∫ (caption) —Å–æ–¥–µ—Ä–∂–∏—Ç –Ω—É–∂–Ω—ã–π —Ç–µ–∫—Å—Ç
for table in tables:
    caption = table.find("caption")
    if caption and "United States presidential election results for Minnesota" in caption.text:
        df = pd.read_html(StringIO(str(table)))[0]
        print(df.head())
        break

   Year Republican         Democratic         Third party(ies)
   Year        No.       %        No.       %              No.      %
0  2024    1519032  46.68%    1656979  50.92%            77909  2.39%
1  2020    1484065  45.28%    1717077  52.40%            76029  2.32%
2  2016    1323232  44.93%    1367825  46.44%           254176  8.63%
3  2012    1320225  44.96%    1546167  52.65%            70169  2.39%
4  2008    1275409  43.82%    1573354  54.06%            61606  2.12%

#### –ö–æ–≥–¥–∞ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å `pandas`, –∞ –∫–æ–≥–¥–∞ `BeautifulSoup`

| –°–∏—Ç—É–∞—Ü–∏—è | –õ—É—á—à–µ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å | –ü–æ—á–µ–º—É |
|-----------|--------------------|--------|
| –ù—É–∂–Ω–æ –±—ã—Å—Ç—Ä–æ –ø–æ–ª—É—á–∏—Ç—å **–≤—Å–µ —Ç–∞–±–ª–∏—Ü—ã** —Å–æ —Å—Ç—Ä–∞–Ω–∏—Ü—ã | `pandas.read_html()` | –ü—Ä–æ—Å—Ç–∞—è –∫–æ–º–∞–Ω–¥–∞, —Å—Ä–∞–∑—É –≤–æ–∑–≤—Ä–∞—â–∞–µ—Ç —Å–ø–∏—Å–æ–∫ `DataFrame` |
| –ù—É–∂–Ω–æ –∏–∑–≤–ª–µ—á—å **–æ–¥–Ω—É —Ç–∞–±–ª–∏—Ü—É –ø–æ –Ω–∞–∑–≤–∞–Ω–∏—é** –∏–ª–∏ –ø–æ **–∞—Ç—Ä–∏–±—É—Ç–∞–º (`class`, `id`)** | `pandas.read_html(..., match=...)` –∏–ª–∏ `attrs={...}` | –£–¥–æ–±–Ω–æ, –µ—Å–ª–∏ —Å—Ç—Ä–∞–Ω–∏—Ü–∞ –∞–∫–∫—É—Ä–∞—Ç–Ω–æ —Ä–∞–∑–º–µ—á–µ–Ω–∞ |
| –ù—É–∂–Ω–æ –∏–∑–≤–ª–µ—á—å **—Ç–æ–ª—å–∫–æ —á–∞—Å—Ç—å —Ç–∞–±–ª–∏—Ü—ã**, –∏–ª–∏ —Ç–∞–±–ª–∏—Ü—É, —É –∫–æ—Ç–æ—Ä–æ–π –Ω–µ—Ç —á—ë—Ç–∫–∏—Ö –∞—Ç—Ä–∏–±—É—Ç–æ–≤ | `BeautifulSoup` + `pandas` | –ü–æ–∑–≤–æ–ª—è–µ—Ç –≥–∏–±–∫–æ –∏—Å–∫–∞—Ç—å –ø–æ —Ç–µ–≥–∞–º, —Ç–µ–∫—Å—Ç—É, —Å—Ç—Ä—É–∫—Ç—É—Ä–µ —Å—Ç—Ä–∞–Ω–∏—Ü—ã |
| –ù—É–∂–Ω–æ –ø–æ–ª—É—á–∏—Ç—å **–¥—Ä—É–≥–∏–µ –¥–∞–Ω–Ω—ã–µ** (—Å–ø–∏—Å–∫–∏, –∑–∞–≥–æ–ª–æ–≤–∫–∏, —Ç–µ–∫—Å—Ç—ã, —Å—Å—ã–ª–∫–∏) | `BeautifulSoup` | `pandas` —Ä–∞–±–æ—Ç–∞–µ—Ç —Ç–æ–ª—å–∫–æ —Å —Ç–∞–±–ª–∏—Ü–∞–º–∏ |
| –°—Ç—Ä–∞–Ω–∏—Ü–∞ **–∑–∞–≥—Ä—É–∂–∞–µ—Ç—Å—è –¥–∏–Ω–∞–º–∏—á–µ—Å–∫–∏ (—á–µ—Ä–µ–∑ JS)** | `requests` + `BeautifulSoup` –Ω–µ –ø–æ–º–æ–≥—É—Ç ‚Äî –Ω—É–∂–µ–Ω Selenium –∏–ª–∏ API | –í —Ç–∞–∫–∏—Ö —Å–ª—É—á–∞—è—Ö –¥–∞–Ω–Ω—ã–µ –Ω—É–∂–Ω–æ –∏—Å–∫–∞—Ç—å —á–µ—Ä–µ–∑ API —Å–∞–π—Ç–∞ –∏–ª–∏ –±—Ä–∞—É–∑–µ—Ä–Ω—É—é –∞–≤—Ç–æ–º–∞—Ç–∏–∑–∞—Ü–∏—é |

üí° **–ò—Ç–æ–≥:**  
`pandas.read_html()` ‚Äî –±—ã—Å—Ç—Ä–æ –∏ —É–¥–æ–±–Ω–æ, –∫–æ–≥–¥–∞ —Ç–∞–±–ª–∏—Ü—ã —Ö–æ—Ä–æ—à–æ —Ä–∞–∑–º–µ—á–µ–Ω—ã.  
`BeautifulSoup` ‚Äî –≥–∏–±–∫–æ –∏ —Ç–æ—á–Ω–æ, –∫–æ–≥–¥–∞ —Å—Ç—Ä—É–∫—Ç—É—Ä–∞ —Å—Ç—Ä–∞–Ω–∏—Ü—ã —Å–ª–æ–∂–Ω–∞—è –∏–ª–∏ –Ω–µ—Å—Ç–∞–Ω–¥–∞—Ä—Ç–Ω–∞—è.  
–ß–∞—Å—Ç–æ —ç—Ç–∏ –∏–Ω—Å—Ç—Ä—É–º–µ–Ω—Ç—ã –∏—Å–ø–æ–ª—å–∑—É—é—Ç **–≤–º–µ—Å—Ç–µ**: `requests` ‚Üí `BeautifulSoup` ‚Üí `pandas`.

#### –ò–º–ø–æ—Ä—Ç –¥–∞–Ω–Ω—ã—Ö –∏–∑ —Ñ–∞–π–ª–æ–≤

In [ ]:
# –ß—Ç–µ–Ω–∏–µ –∏–∑ csv-—Ñ–∞–π–ª–∞
df = pd.read_csv("AAPL.csv", sep=",")
df.head(5)

         Date      Open      High       Low     Close  Adj Close     Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.406782  117258400
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.385558   43971200
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.357260   26432000
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.366103   21610400
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.376715   18362400

In [ ]:
# –ß—Ç–µ–Ω–∏–µ –∏–∑ —Ñ–∞–π–ª–∞ json
df = pd.read_json("sample-stocks-data.json")
df.tail(10)

,company,description,initial_price,price_2002,price_2007,symbol
12,Microsoft,"Microsoft develops, manufactures, licenses, an...",55.72,22.62,29.84,MSFT
13,Monsanto,Monsanto provides agricultural products for fa...,11.47,7.20,86.93,MO
14,PepsiCo,"PepsiCo, Inc. manufactures, markets, and sells...",34.13,36.69,73.74,PEP
15,Starbucks,Starbucks Corp. provides specialty coffee and ...,6.23,10.50,26.84,SBUX
16,Texas Instruments,Texas Instruments designs and sells semiconduc...,53.88,15.58,36.54,TXN
17,Time Warner,Time Warner is a media and entertainment compa...,221.25,36.36,57.18,TWX
18,United Health,UnitedHealth Group provides healthcare service...,7.66,21.85,47.70,UNH
19,Walmart,"Walmart operates retail stores, warehouse club...",56.50,50.51,47.53,WMT
20,Whirlpool,Whirlpool manufactures and sells home applianc...,58.25,46.82,94.29,WHR
21,Xerox,"Xerox Corporation engages in the development, ...",20.87,5.26,17.54,XRX

In [ ]:
# –ß—Ç–µ–Ω–∏–µ –∏–∑ —Ñ–∞–π–ª–∞ XML
pd.read_xml("stock.xml").head(5)

  categories    offers
0   \n        \n

#### –ß—Ç–µ–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö –Ω–∞–ø—Ä—è–º—É—é –∏–∑ –ë–î —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º —è–∑—ã–∫–∞ SQL

In [ ]:
password = "password"
user = "postgres"
pd.read_sql("""select symbol,
                           avg(volume) as avg_vol
                      from stocks
                     where extract(year from "date") = 2009
                     group by symbol
                     ;
""", f"postgresql://{user}:{password}@localhost:54321/example").head(5)

ImportError: Using URI string without sqlalchemy installed.

### –í—ã–≤–æ–¥ –¥–∞–Ω–Ω—ã—Ö –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞

In [ ]:
df.head() # –í—ã–≤–æ–¥ –ø–µ—Ä–≤—ã—Ö —Å—Ç—Ä–æ–∫ –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞
df.tail() # –í—ã–≤–æ–¥ –ø–æ—Å–ª–µ–¥–Ω–∏—Ö —Å—Ç—Ä–æ–∫ –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞

,company,description,initial_price,price_2002,price_2007,symbol
17,Time Warner,Time Warner is a media and entertainment compa...,221.25,36.36,57.18,TWX
18,United Health,UnitedHealth Group provides healthcare service...,7.66,21.85,47.70,UNH
19,Walmart,"Walmart operates retail stores, warehouse club...",56.50,50.51,47.53,WMT
20,Whirlpool,Whirlpool manufactures and sells home applianc...,58.25,46.82,94.29,WHR
21,Xerox,"Xerox Corporation engages in the development, ...",20.87,5.26,17.54,XRX

### –ü–∞—Ä–∞–º–µ—Ç—Ä—ã —á—Ç–µ–Ω–∏—è –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞: head, sep –∏ –¥—Ä—É–≥–∏–µ

In [ ]:
df = pd.read_csv("AAPL.csv", sep=',', names=['date','open','high','low','close','adj_close','volume'], header=0, date_format='%Y-%m-%d')
df.head(5)

         date      open      high       low     close  adj_close     volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.406782  117258400
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.385558   43971200
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.357260   26432000
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.366103   21610400
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.376715   18362400

In [ ]:
?pd.read_csv

## –í–∞—à–∏ –≤–æ–ø—Ä–æ—Å—ã

## 2. –ú–µ—Ç–æ–¥—ã –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–æ–≤

In [ ]:
# –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–æ–∫ DF
print(len(df))

9909

In [ ]:
df.shape

(9909, 7)

### –ü—Ä–æ—Å—Ç—ã–µ –º–µ—Ç–æ–¥—ã –≤—ã—á–∏—Å–ª–µ–Ω–∏—è –¥–ª—è –Ω–æ–≤–æ–≥–æ —Å—Ç–æ–ª–±—Ü–∞

In [ ]:
# –ï—Å–ª–∏ –¥–∞–Ω–Ω—ã–µ —É–∂–µ –∑–∞–≥—Ä—É–∂–µ–Ω—ã —Å –∑–∞–≥–æ–ª–æ–≤–∫–∞–º–∏ –∫–∞–∫ –¥–∞–Ω–Ω—ã–µ
# –ù—É–∂–Ω–æ —É–¥–∞–ª–∏—Ç—å –ø–µ—Ä–≤—É—é —Å—Ç—Ä–æ–∫—É (–∫–æ—Ç–æ—Ä–∞—è —Å–æ–¥–µ—Ä–∂–∏—Ç –∑–∞–≥–æ–ª–æ–≤–∫–∏)
# df = df.iloc[1:]  # –£–¥–∞–ª—è–µ–º –ø–µ—Ä–≤—É—é —Å—Ç—Ä–æ–∫—É

# –ü—Ä–µ–æ–±—Ä–∞–∑—É–µ–º —Å—Ç–æ–ª–±—Ü—ã –≤ —á–∏—Å–ª–æ–≤–æ–π —Ç–∏–ø
df['high'] = pd.to_numeric(df['high'])
df['low'] = pd.to_numeric(df['low'])

# –¢–µ–ø–µ—Ä—å –º–æ–∂–µ–º –≤—ã–ø–æ–ª–Ω–∏—Ç—å –≤—ã—á–∏—Å–ª–µ–Ω–∏—è
df['high_low_diff'] = df['high'] - df['low']

df.head()

,date,open,high,low,close,adj_close,volume,high_low_diff
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232

### –ü–æ–ª—É—á–µ–Ω–∏–µ –æ—Å–Ω–æ–≤–Ω—ã—Ö —Å–≤–µ–¥–µ–Ω–∏–π –æ –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–µ

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9909 entries, 0 to 9908
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           9909 non-null   object
 1   open           9909 non-null   float64
 2   high           9909 non-null   float64
 3   low            9909 non-null   float64
 4   close          9909 non-null   float64
 5   adj_close      9909 non-null   float64
 6   volume         9909 non-null   int64
 7   high_low_diff  9909 non-null   float64
dtypes: float64(6), int64(1), object(1)
memory usage: 619.4+ KB

In [ ]:
df.describe()

,open,high,low,close,adj_close,volume,high_low_diff
count,9909.000000,9909.000000,9909.000000,9909.000000,9909.000000,9.909000e+03,9909.000000
mean,32.606849,32.936079,32.277560,32.618030,30.576570,8.582916e+07,0.658519
std,58.415759,59.001576,57.883037,58.471899,56.746275,8.597195e+07,1.422116
min,0.198661,0.198661,0.196429,0.196429,0.155638,3.472000e+05,0.000000
25%,1.071429,1.089286,1.048571,1.071429,0.917643,3.304230e+07,0.035714
50%,1.729286,1.758929,1.696429,1.732143,1.466154,5.766490e+07,0.072857
75%,35.799999,36.265713,35.328571,35.761429,31.042374,1.069992e+08,0.745714
max,324.739990,327.850006,323.350006,327.200012,327.200012,1.855410e+09,26.970016

In [ ]:
df.columns

Index(['date', 'open', 'high', 'low', 'close', 'adj_close', 'volume'], dtype='object')

In [ ]:
df[['open', 'close']]

            open       close
0       0.513393    0.513393
1       0.488839    0.486607
2       0.453125    0.450893
3       0.462054    0.462054
4       0.475446    0.475446
...          ...         ...
9904  246.520004  258.440002
9905  252.750000  247.740005
9906  250.740005  254.809998
9907  255.600006  254.289993
9908  246.500000  240.910004

[9909 rows x 2 columns]

### –û—Ç–¥–µ–ª—å–Ω—ã–π —Å—Ç–æ–ª–±–µ—Ü: –æ–±—Ä–∞—â–µ–Ω–∏–µ –∏ –º–µ—Ç–æ–¥—ã

In [ ]:
df['volume'].head()

0    117258400
1     43971200
2     26432000
3     21610400
4     18362400
Name: volume, dtype: int64

In [ ]:
df.volume.head()

0    117258400
1     43971200
2     26432000
3     21610400
4     18362400
Name: volume, dtype: int64

In [ ]:
type(df['volume'])

pandas.core.series.Series

In [ ]:
# –£–Ω–∏–∫–∞–ª—å–Ω—ã–µ –∑–Ω–∞—á–µ–Ω–∏—è –≤ —Å—Ç–æ–ª–±—Ü–µ
df.volume.unique()

array([117258400,  43971200,  26432000, ...,  41994100,  49250500,
        43956200], shape=(9350,))

In [ ]:
# –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –≤ —Å—Ç–æ–ª–±—Ü–µ
len(df.volume.unique())

9350

In [ ]:
df.volume.nunique()

9350

In [ ]:
#–†–∞—Å–ø—Ä–µ–¥–µ–ª–µ–Ω–∏–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞ —Å—Ç—Ä–æ–∫ –ø–æ –∑–Ω–∞—á–µ–Ω–∏—è–º —Å—Ç–æ–ª–±—Ü–∞
df.volume.value_counts()

volume
61600000     7
61040000     6
59920000     6
75600000     5
63840000     5
            ..
184097200    1
89706400     1
65027200     1
55778800     1
38553200     1
Name: count, Length: 9350, dtype: int64

In [ ]:
df['volume'].value_counts(normalize=True)

volume
61600000     0.000706
61040000     0.000606
59920000     0.000606
75600000     0.000505
63840000     0.000505
               ...
184097200    0.000101
89706400     0.000101
65027200     0.000101
55778800     0.000101
38553200     0.000101
Name: proportion, Length: 9350, dtype: float64

In [ ]:
df.head()

,date,open,high,low,close,adj_close,volume,high_low_diff
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232

## –í–∞—à–∏ –≤–æ–ø—Ä–æ—Å—ã

## 3. –°–æ—Ä—Ç–∏—Ä–æ–≤–∫–∞ –¥–∞–Ω–Ω—ã—Ö

In [ ]:
df.sort_values(by='date')

,date,open,high,low,close,adj_close,volume,high_low_diff
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232
...,...,...,...,...,...,...,...,...
9904,2020-03-26,246.520004,258.679993,246.360001,258.440002,258.440002,63021800,12.319992
9905,2020-03-27,252.750000,255.869995,247.050003,247.740005,247.740005,51054200,8.819992
9906,2020-03-30,250.740005,255.520004,249.399994,254.809998,254.809998,41994100,6.120010
9907,2020-03-31,255.600006,262.489990,252.000000,254.289993,254.289993,49250500,10.489990
9908,2020-04-01,246.500000,248.720001,239.130005,240.910004,240.910004,43956200,9.589996

In [ ]:
df.sort_values(by='date', ascending=False)

,date,open,high,low,close,adj_close,volume,high_low_diff
9908,2020-04-01,246.500000,248.720001,239.130005,240.910004,240.910004,43956200,9.589996
9907,2020-03-31,255.600006,262.489990,252.000000,254.289993,254.289993,49250500,10.489990
9906,2020-03-30,250.740005,255.520004,249.399994,254.809998,254.809998,41994100,6.120010
9905,2020-03-27,252.750000,255.869995,247.050003,247.740005,247.740005,51054200,8.819992
9904,2020-03-26,246.520004,258.679993,246.360001,258.440002,258.440002,63021800,12.319992
...,...,...,...,...,...,...,...,...
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,0.002232
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,0.002232
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,0.002232
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,0.002232
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,0.002232

In [ ]:
df.sort_values(by=['volume', 'date'], ascending=[True, False])

,date,open,high,low,close,adj_close,volume,high_low_diff
524,1983-01-11,0.513393,0.526786,0.513393,0.520089,0.412087,347200,0.013393
2936,1992-07-27,1.633929,1.660714,1.616071,1.616071,1.344507,599200,0.044643
107,1981-05-18,0.500000,0.504464,0.500000,0.500000,0.396170,1041600,0.004464
103,1981-05-12,0.488839,0.495536,0.488839,0.488839,0.387327,1064000,0.006696
106,1981-05-15,0.491071,0.497768,0.491071,0.491071,0.389095,1226400,0.006696
...,...,...,...,...,...,...,...,...
4743,1999-09-21,2.613839,2.616071,2.464286,2.473214,2.146850,839389600,0.151786
6839,2008-01-23,19.455715,20.000000,18.020000,19.867144,17.245489,843242400,1.980000
4209,1997-08-07,1.026786,1.055804,1.013393,1.042411,0.904855,938859600,0.042411
4208,1997-08-06,0.901786,0.991071,0.892857,0.939732,0.815726,1047620000,0.098214
5003,2000-09-29,2.013393,2.071429,1.812500,1.839286,1.596575,1855410200,0.258929

In [ ]:
#–ü–∞—Ä–∞–º–µ—Ç—Ä inplace –ø–µ—Ä–µ–∑–∞–ø–∏—Å—ã–≤–∞–µ—Ç –¥–∞–Ω–Ω—ã–µ –≤ DF
df.sort_values(by=['open', 'close'], ascending=[True, False], inplace=True)

In [ ]:
df.head()

,date,open,high,low,close,adj_close,volume,high_low_diff
394,1982-07-08,0.198661,0.198661,0.196429,0.196429,0.155638,41081600,0.002232
395,1982-07-09,0.203125,0.205357,0.203125,0.203125,0.160944,32104800,0.002232
393,1982-07-07,0.205357,0.207589,0.205357,0.205357,0.162713,7593600,0.002232
396,1982-07-12,0.207589,0.209821,0.207589,0.207589,0.164481,15848000,0.002232
392,1982-07-06,0.207589,0.207589,0.205357,0.205357,0.162713,21924000,0.002232

## –í–∞—à–∏ –≤–æ–ø—Ä–æ—Å—ã

### 4. –ì—Ä—É–ø–ø–∏—Ä–æ–≤–∫–∞ –¥–∞–Ω–Ω—ã—Ö

### –§—É–Ω–∫—Ü–∏–∏, –≤—ã–ø–æ–ª–Ω—è–µ–º—ã–µ –Ω–∞–¥ –¥–∞–Ω–Ω—ã–º–∏ –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞

In [ ]:
def get_trand(row) -> str:
    return "bear" if row['open'] < row['close'] else 'bull' if row['open'] != row['close'] else 'floor'

# –ü—Ä–∏–º–µ–Ω—è–µ–º –∫–æ –≤—Å–µ–º—É –¥–∞—Ç–∞—Ñ—Ä–µ–π–º—É, –Ω–æ –∏—Å–ø–æ–ª—å–∑—É–µ–º —Ç–æ–ª—å–∫–æ –Ω—É–∂–Ω—ã–µ —Å—Ç–æ–ª–±—Ü—ã
df['trand'] = df.apply(get_trand, axis=1)

df.head()

,date,open,high,low,close,adj_close,volume,trand
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,floor
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,bull
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,bull
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,floor
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,floor

In [ ]:
df['trand'] = df.apply(lambda row: "bear" if row['open'] < row['close'] else 'bull' if row['open'] != row['close'] else 'floor', axis=1)

df.head()

,date,open,high,low,close,adj_close,volume,trand
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,floor
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,bull
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,bull
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,floor
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,floor

In [ ]:
import numpy as np

df['trand'] = np.where(df['open'] < df['close'], 'bear',
           np.where(df['open'] != df['close'], 'bull', 'floor'))

df.head()

,date,open,high,low,close,adj_close,volume,trand
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,floor
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,bull
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,bull
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,floor
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,floor

In [ ]:
df['weekday'] = pd.to_datetime(df['date']).dt.day_name()

df.head()

,date,open,high,low,close,adj_close,volume,weekday
0,1980-12-12,0.513393,0.515625,0.513393,0.513393,0.406782,117258400,Friday
1,1980-12-15,0.488839,0.488839,0.486607,0.486607,0.385558,43971200,Monday
2,1980-12-16,0.453125,0.453125,0.450893,0.450893,0.357260,26432000,Tuesday
3,1980-12-17,0.462054,0.464286,0.462054,0.462054,0.366103,21610400,Wednesday
4,1980-12-18,0.475446,0.477679,0.475446,0.475446,0.376715,18362400,Thursday

In [ ]:
# –ì—Ä—É–ø–ø–∏—Ä–æ–≤–∫–∞ –ø–æ –º–µ—Å—è—Ü–∞–º
df['month'] = pd.to_datetime(df['date']).dt.month
monthly_stats = df.groupby('month').agg({
    'open': 'mean',
    'high': 'max',
    'low': 'min',
    'close': 'mean',
    'volume': 'sum'
}).round(2)

monthly_stats.head()

        open    high   low  close       volume
month
1      33.51  327.85  0.32  33.51  94794431400
2      34.51  327.22  0.33  34.58  67243825000
3      34.42  304.00  0.25  34.45  73637328400
4      29.90  248.72  0.26  29.89  72077343500
5      30.51  215.31  0.25  30.55  64978307300

In [ ]:
# –ì—Ä—É–ø–ø–∏—Ä–æ–≤–∫–∞ –ø–æ —Ç—Ä–µ–Ω–¥–∞–º
if 'trand' in df.columns:
    trend_analysis = df.groupby('trand').agg({
        'volume': ['count', 'mean', 'std'],
        'close': ['mean', 'std']
    })

    trend_analysis.head()

## –í–∞—à–∏ –≤–æ–ø—Ä–æ—Å—ã

### 5. –≠–∫—Å–ø–æ—Ä—Ç –¥–∞–Ω–Ω—ã—Ö

In [ ]:
# –°–æ—Ö—Ä–∞–Ω–µ–Ω–∏–µ –≤ CSV
df.to_csv('processed_stock_data.csv', index=False)

# –°–æ—Ö—Ä–∞–Ω–µ–Ω–∏–µ –≤ Excel —Å –Ω–µ—Å–∫–æ–ª—å–∫–∏–º–∏ –ª–∏—Å—Ç–∞–º–∏
with pd.ExcelWriter('stock_analysis.xlsx') as writer:
    df.to_excel(writer, sheet_name='Raw Data', index=False)
    monthly_stats.to_excel(writer, sheet_name='Monthly Stats')
    if 'trand' in df.columns:
        trend_analysis.to_excel(writer, sheet_name='Trend Analysis')

# –°–æ—Ö—Ä–∞–Ω–µ–Ω–∏–µ –≤ JSON
df.to_json('stock_data.json', orient='records', date_format='iso')

## –í–∞—à–∏ –≤–æ–ø—Ä–æ—Å—ã

## –ò—Ç–æ–≥–∏ –∑–∞–Ω—è—Ç–∏—è

–ù–∞—É—á–∏–ª–∏—Å—å —Ä–∞–±–æ—Ç–∞—Ç—å —Å –±–∏–±–ª–∏–æ—Ç–µ–∫–æ–π Pandas:
- –∑–∞–≥—Ä—É–∂–∞—Ç—å –¥–∞–Ω–Ω—ã–µ –∏–∑ —Ä–∞–∑–ª–∏—á–Ω—ã—Ö —Ñ–æ—Ä–º–∞—Ç–æ–≤ –≤–Ω–µ—à–Ω–∏—Ö –∏—Å—Ç–æ—á–Ω–∏–∫–æ–≤
- —Ñ–∏–ª—å—Ç—Ä–æ–≤–∞—Ç—å, —Å–æ—Ä—Ç–∏—Ä–æ–≤–∞—Ç—å, –≥—Ä—É–ø–ø–∏—Ä–æ–≤–∞—Ç—å –∏ –∞–≥—Ä–µ–≥–∏—Ä–æ–≤–∞—Ç—å –¥–∞–Ω–Ω—ã–µ